In [1]:
import pandas as pd
import numpy as np

In [3]:
fruit = pd.Series(['watermelon','apple',np.nan,'lemon'])

In [4]:
fruit

0    watermelon
1         apple
2           NaN
3         lemon
dtype: object

In [6]:
fruit.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
fruit.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [8]:
fruit.dropna()

0    watermelon
1         apple
3         lemon
dtype: object

In [9]:
fruit

0    watermelon
1         apple
2           NaN
3         lemon
dtype: object

In [11]:
fruit.fillna('unknown')

0    watermelon
1         apple
2       unknown
3         lemon
dtype: object

In [12]:
fruit

0    watermelon
1         apple
2           NaN
3         lemon
dtype: object

In [17]:
fruits = pd.DataFrame(fruit)

In [23]:
fruits.rename(index=str,columns={0:'fruits'})

       fruits
0  watermelon
1       apple
2         NaN
3       lemon

In [26]:
more_fruit = ['pear','gala apple','lime']

In [27]:
more_fruit

['pear', 'gala apple', 'lime']

In [28]:
pd.Series(more_fruit)

0          pear
1    gala apple
2          lime
dtype: object

In [38]:
more_fruit = pd.DataFrame(more_fruit)

In [39]:
more_fruit.rename(index=str,columns={0:'fruit'})

        fruit
0        pear
1  gala apple
2        lime

In [41]:
pd.concat([fruits,more_fruit])

            0
0  watermelon
1       apple
2         NaN
3       lemon
0        pear
1  gala apple
2        lime

In [42]:
fruit_total = pd.concat([fruits,more_fruit])

In [43]:
fruit_total.rename(index=str,columns={0:'list'})

         list
0  watermelon
1       apple
2         NaN
3       lemon
0        pear
1  gala apple
2        lime

In [45]:
fruit_total = fruit_total.rename(index=str,columns={0:'list'})

In [48]:
item = [3,7,np.nan,4,6,2,5]

In [51]:
item = pd.DataFrame(item)

In [64]:
item = item.rename(index=str,columns={0:'number'})

In [128]:
pd.concat([fruit_total,item.reset_index(drop=True)],axis=1)

         list  number
0  watermelon     3.0
1       apple     7.0
2         NaN     NaN
3       lemon     4.0
4        pear     6.0
5  gala apple     2.0
6        lime     5.0

In [132]:
item

   number
0     3.0
1     7.0
2     NaN
3     4.0
4     6.0
5     2.0
6     5.0

In [133]:
fruit_total

         list
0  watermelon
1       apple
2         NaN
3       lemon
4        pear
5  gala apple
6        lime

In [136]:
data = pd.Series([1,np.nan,3.5,np.nan,7])

In [140]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [141]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [142]:
data = pd.DataFrame([[1.,6.5,4.],[1.,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3.]])

In [143]:
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [160]:
#drop only rows that are all na
data.dropna(how='all')

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [166]:
sum(data.isnull().values.ravel())

6

In [170]:
sum(data[0].isnull().values.ravel())

2

In [172]:
# how many rows have missing data
# get number of rows data.shape[0]
# then subtract those without missing data, thats data.dropna()

3

In [197]:
data.shape[0] - data.dropna().shape[0]

3

In [212]:
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [268]:
data.isnull().sum(axis=1)

0    0
1    2
2    3
3    1
dtype: int64

In [276]:
data.fillna(0)

     0    1    2
0  1.0  6.5  4.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [278]:
data.fillna({0:2000,1:5,2:1000})

        0    1       2
0     1.0  6.5     4.0
1     1.0  5.0  1000.0
2  2000.0  5.0  1000.0
3  2000.0  6.5     3.0

In [279]:
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [284]:
data.fillna(data.mean())

     0    1    2
0  1.0  6.5  4.0
1  1.0  6.5  3.5
2  1.0  6.5  3.5
3  1.0  6.5  3.0

In [285]:
# dropping duplicates
data1 = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})

In [286]:
data1

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [287]:
# there's a duplicate on index 5 and 6

In [290]:
data1.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [291]:
data1.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [293]:
data1['v1'] = range(7)

In [294]:
data1

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [300]:
data1.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [302]:
data1.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [304]:
gabe = [['happy','singing'],['gamblin','risk'],['sad','happy']]

In [305]:
gabe

[['happy', 'singing'], ['gamblin', 'risk'], ['sad', 'happy']]

In [306]:
gabe = pd.DataFrame(gabe)

         0        1
0    happy  singing
1  gamblin     risk
2      sad    happy

In [307]:
kaylee = [['sexy','smiling'],['bossy boots','risk'],['happy','baking']]

In [308]:
kaylee = pd.DataFrame(kaylee)

In [309]:
kaylee

             0        1
0         sexy  smiling
1  bossy boots     risk
2        happy   baking

In [315]:
gabe = pd.DataFrame(gabe)

In [316]:
gabe

         0        1
0    happy  singing
1  gamblin     risk
2      sad    happy

In [320]:
together = pd.concat([gabe,kaylee],axis=0)

In [321]:
together

             0        1
0        happy  singing
1      gamblin     risk
2          sad    happy
0         sexy  smiling
1  bossy boots     risk
2        happy   baking

In [322]:
rando = [['happy','singing'],['bossy boots','risk'],['happy','jamming']]

In [325]:
rando = pd.DataFrame(rando)

In [328]:
togethernow = pd.concat([together,rando],axis=0)

In [334]:
sum(togethernow.duplicated().values)

2

In [336]:
# remove first instance
togethernow.drop_duplicates()

             0        1
0        happy  singing
1      gamblin     risk
2          sad    happy
0         sexy  smiling
1  bossy boots     risk
2        happy   baking
2        happy  jamming

In [339]:
togethernow.drop_duplicates(keep='last')

             0        1
1      gamblin     risk
2          sad    happy
0         sexy  smiling
2        happy   baking
0        happy  singing
1  bossy boots     risk
2        happy  jamming

In [341]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corner beef','Bacon','pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [342]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corner beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [343]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [344]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [353]:
pd.DataFrame(pd.Series(meat_to_animal)).reset_index()

         index       0
0        bacon     pig
1  pulled pork     pig
2     pastrami     cow
3  corned beef     cow
4    honey ham     pig
5     nova lox  salmon

In [354]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corner beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [355]:
data['food'].str.lower()

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corner beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [358]:
lowercase = data['food'].str.lower()

In [359]:
lowercase.map(meat_to_animal)

0       pig
1       pig
2       pig
3       cow
4       NaN
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [361]:
data['animal'] = lowercase.map(meat_to_animal)

In [362]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corner beef     7.5     NaN
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [2]:
fruit = ['Watermelon','apple','lime','lemons','Blueberries',np.nan,'cantelope',np.nan]

In [3]:
fruit = pd.Series(fruit)

In [4]:
number = [2,5,7,4,38,np.nan,3,np.nan]

In [5]:
number = pd.Series(number)

In [6]:
fruits = pd.concat([fruit,number],axis=1)

In [7]:
type_fruit = {'watermelon':'seeds','apple':'seeds','lime':'no seeds','lemons':'seeds','blueberries':'no seeds','cantelope':'seeds'}

In [422]:
# this wont work because not lowercase
fruits.map(type_fruit)

AttributeError: 'DataFrame' object has no attribute 'map'

In [8]:
fruits

             0     1
0   Watermelon   2.0
1        apple   5.0
2         lime   7.0
3       lemons   4.0
4  Blueberries  38.0
5          NaN   NaN
6    cantelope   3.0
7          NaN   NaN

In [11]:
lower = fruits[0].str.lower()

In [12]:
lower.map(type_fruit)

0       seeds
1       seeds
2    no seeds
3       seeds
4    no seeds
5         NaN
6       seeds
7         NaN
Name: 0, dtype: object

In [13]:
fruits['type'] = lower.map(type_fruit)

In [14]:
fruits

             0     1      type
0   Watermelon   2.0     seeds
1        apple   5.0     seeds
2         lime   7.0  no seeds
3       lemons   4.0     seeds
4  Blueberries  38.0  no seeds
5          NaN   NaN       NaN
6    cantelope   3.0     seeds
7          NaN   NaN       NaN

In [16]:
fruits = fruits.rename(columns={0:'Fruit',1:'Number','type':'Type'})

In [18]:
fruits['Fruit'] = fruits['Fruit'].str.lower()

In [19]:
fruits

         Fruit  Number      Type
0   watermelon     2.0     seeds
1        apple     5.0     seeds
2         lime     7.0  no seeds
3       lemons     4.0     seeds
4  blueberries    38.0  no seeds
5          NaN     NaN       NaN
6    cantelope     3.0     seeds
7          NaN     NaN       NaN

In [24]:
sum(fruits.isnull().values.ravel()) # total missing values

6

In [30]:
fruits.shape[0] - fruits.dropna().shape[0] # number of missing row

2

In [38]:
fruits.fillna({'Fruit':'Unknown','Number':'NA'})

         Fruit Number      Type
0   watermelon      2     seeds
1        apple      5     seeds
2         lime      7  no seeds
3       lemons      4     seeds
4  blueberries     38  no seeds
5      Unknown     NA       NaN
6    cantelope      3     seeds
7      Unknown     NA       NaN

In [42]:
fruits.replace(np.nan,'GABEY RULES')

         Fruit       Number         Type
0   watermelon            2        seeds
1        apple            5        seeds
2         lime            7     no seeds
3       lemons            4        seeds
4  blueberries           38     no seeds
5  GABEY RULES  GABEY RULES  GABEY RULES
6    cantelope            3        seeds
7  GABEY RULES  GABEY RULES  GABEY RULES

In [47]:
fruits['Fruit'] = fruits['Fruit'].replace(np.nan,'GABEY RULES')

In [50]:
fruits

         Fruit  Number      Type
0   watermelon     2.0     seeds
1        apple     5.0     seeds
2         lime     7.0  no seeds
3       lemons     4.0     seeds
4  blueberries    38.0  no seeds
5  GABEY RULES     NaN       NaN
6    cantelope     3.0     seeds
7  GABEY RULES     NaN       NaN

In [55]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])

In [56]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [60]:
# transform first 4 space to all caps
transform = lambda x: x[:4].upper()

In [62]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [63]:
data.index = data.index.map(transform)

In [64]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [65]:
# can also use the rename
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [67]:
data.rename(index=str.lower,columns=str.upper)

      ONE  TWO  THREE  FOUR
ohio    0    1      2     3
colo    4    5      6     7
new     8    9     10    11

In [82]:
data.rename(columns={'one':'Number one'},index={'OHIO':'Ohio'})

      Number one  two  three  four
Ohio           0    1      2     3
COLO           4    5      6     7
NEW            8    9     10    11

In [91]:
data.reset_index(inplace=True)

In [98]:
data.rename(columns={'index':'State'},index={0:'Amount of coolness',1:'Amount of coolness',2:'Amount of coolness'})

                   State  one  two  three  four
Amount of coolness  OHIO    0    1      2     3
Amount of coolness  COLO    4    5      6     7
Amount of coolness  NEW     8    9     10    11

In [99]:
data

  index  one  two  three  four
0  OHIO    0    1      2     3
1  COLO    4    5      6     7
2  NEW     8    9     10    11

In [119]:
ages = [20,22,25,27,21,23,37,61,45,41,32]

In [120]:
bins = [18,25,35,60,100]

In [121]:
cats = pd.cut(ages,bins)

In [122]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [111]:
ages = pd.DataFrame(ages)

In [113]:
cats = pd.DataFrame(cats)

In [115]:
pd.concat([ages,cats],axis=1)

     0          0
0   20   (18, 25]
1   22   (18, 25]
2   25   (18, 25]
3   27   (25, 35]
4   21   (18, 25]
5   23   (18, 25]
6   37   (35, 60]
7   61  (60, 100]
8   45   (35, 60]
9   41   (35, 60]
10  32   (25, 35]

In [123]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [124]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 3, 2, 2, 1], dtype=int8)

In [125]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [35, 60), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 11
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [126]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [127]:
group_names = ['Youth','Young Adult','Middle Aged','Senior']

In [143]:
pd.concat([pd.DataFrame(ages),pd.DataFrame(cats),pd.DataFrame(pd.cut(ages,bins,labels=group_names))],axis=1)

     0          0            0
0   20   (18, 25]        Youth
1   22   (18, 25]        Youth
2   25   (18, 25]        Youth
3   27   (25, 35]  Young Adult
4   21   (18, 25]        Youth
5   23   (18, 25]        Youth
6   37   (35, 60]  Middle Aged
7   61  (60, 100]       Senior
8   45   (35, 60]  Middle Aged
9   41   (35, 60]  Middle Aged
10  32   (25, 35]  Young Adult

In [146]:
# pandas can automatically create equal bins for you
data = np.random.rand(20)

In [152]:
pd.cut(data,4,precision=2) #uniformaly cut into fourths, precision=2 just puts to 2 decimal places

[(0.15, 0.34], (0.72, 0.91], (0.53, 0.72], (0.53, 0.72], (0.34, 0.53], ..., (0.15, 0.34], (0.72, 0.91], (0.15, 0.34], (0.53, 0.72], (0.34, 0.53]]
Length: 20
Categories (4, interval[float64]): [(0.15, 0.34] < (0.34, 0.53] < (0.53, 0.72] < (0.72, 0.91]]

In [167]:
age_stuff = pd.concat([pd.DataFrame(ages),pd.DataFrame(pd.cut(data,4,precision=2))],axis=1)

In [169]:
age_stuff = age_stuff.dropna()

In [193]:
age_data = pd.concat([pd.DataFrame(ages),pd.DataFrame(cats),pd.DataFrame(pd.cut(ages,bins,labels=group_names))],axis=1)

In [195]:
age_data.columns = ['Age','Age Range','Group']

In [211]:
age_data.groupby('Group')['Age Range'].apply(lambda x: x.value_counts().head(1))

Group
Youth        (18, 25]     5
Young Adult  (25, 35]     2
Middle Aged  (35, 60]     3
Senior       (60, 100]    1
Name: Age Range, dtype: int64

In [225]:
pd.DataFrame(age_data.groupby('Group')['Age Range'].apply(lambda x: x.value_counts().head(1))).reset_index()

         Group    level_1  Age Range
0        Youth   (18, 25]          5
1  Young Adult   (25, 35]          2
2  Middle Aged   (35, 60]          3
3       Senior  (60, 100]          1

In [215]:
data = np.random.randn(1000)

In [217]:
cats = pd.qcut(data,4) #cut into quartiles

In [220]:
pd.DataFrame(pd.value_counts(cats)).reset_index()

                index    0
0      (0.681, 3.577]  250
1   (-0.00521, 0.681]  250
2  (-0.684, -0.00521]  250
3    (-4.005, -0.684]  250

In [226]:
data = pd.DataFrame(np.random.randn(1000,4))

In [227]:
data

            0         1         2         3
0    0.760148  1.314948  1.492998  0.725988
1    1.917519 -0.349836 -0.764275 -1.436768
2   -0.344235  2.388270 -0.290178 -2.385880
3    0.622634  1.423160  0.360008 -0.641059
4    0.359522 -1.643897  0.815313  0.163005
..        ...       ...       ...       ...
995 -0.889280  0.343338 -0.809474 -2.372989
996  0.463962 -0.569534 -1.570312 -0.182862
997  0.181731 -0.667300 -0.656722 -0.285014
998 -1.227398 -0.323204  0.108836 -0.313936
999 -0.745447  0.259656 -1.568009 -1.582057

[1000 rows x 4 columns]

In [228]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002613    -0.001276     0.002956     0.002646
std       0.998742     0.996051     1.039316     0.990134
min      -3.371848    -3.445421    -3.445258    -3.394345
25%      -0.685232    -0.667701    -0.708364    -0.662310
50%       0.028371     0.006768    -0.006540    -0.043937
75%       0.665894     0.695941     0.686124     0.676423
max       3.295140     2.942417     3.531436     3.629779

In [230]:
col = data[2]

In [232]:
col[np.abs(col)>3]

103   -3.445258
118    3.237884
391    3.531436
449   -3.248092
Name: 2, dtype: float64

In [234]:
data[0][np.abs(data[0]>3)]

162    3.245249
383    3.295140
946    3.073857
Name: 0, dtype: float64

In [237]:
# to find the rows with values greater than 3
data[(data>3).any(1)]

            0         1         2         3
118  0.974663 -1.584118  3.237884 -0.095327
162  3.245249 -1.335224 -0.614253  0.495389
383  3.295140  0.416965 -0.080157 -0.428164
391 -0.871502 -0.978677  3.531436  1.433771
472 -0.890217 -0.176474  0.018452  3.629779
946  3.073857  0.529484  0.276967  1.621763

In [245]:
data[0][(data[0]>3)]

162    3.245249
383    3.295140
946    3.073857
Name: 0, dtype: float64

In [250]:
# to cap values outside of -3 and 3
data[np.abs(data)>3] = np.sign(data) * 3

In [251]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002079    -0.000504     0.002880     0.002411
std       0.993178     0.993570     1.034792     0.986743
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.685232    -0.667701    -0.708364    -0.662310
50%       0.028371     0.006768    -0.006540    -0.043937
75%       0.665894     0.695941     0.686124     0.676423
max       3.000000     2.942417     3.000000     3.000000

In [326]:
ages = [19,34,25,65,83,33,43,23,47,20, 22, 25, 27, 21, 23, 37, 61, 45, 41, 32]

In [345]:
bins = [18,25,35,65,80,100]

In [312]:
new_age = pd.cut(ages,bins)

In [313]:
new_age

[(18, 25], (25, 35], (18, 25], (35, 65], (80, 100], ..., (35, 65], (35, 65], (35, 65], (35, 65], (25, 35]]
Length: 20
Categories (5, interval[int64]): [(18, 25] < (25, 35] < (35, 65] < (65, 80] < (80, 100]]

In [314]:
new_age = pd.DataFrame(new_age)

In [315]:
ages = pd.DataFrame(ages)

In [323]:
new_age = pd.concat([ages,new_age],axis=1)

In [346]:
group_names = ['Youth','Young Adult','Middle Aged','Senior','Elderly']

In [347]:
groups = pd.DataFrame(group_names)

In [348]:
pd.cut(ages,bins,labels=group_names)

[Youth, Young Adult, Youth, Middle Aged, Elderly, ..., Middle Aged, Middle Aged, Middle Aged, Middle Aged, Young Adult]
Length: 20
Categories (5, object): [Youth < Young Adult < Middle Aged < Senior < Elderly]

In [355]:
newage = pd.DataFrame([ages,pd.cut(ages,bins,labels=group_names)]).T

In [364]:
pd.DataFrame(pd.cut(ages,bins))

            0
0    (18, 25]
1    (25, 35]
2    (18, 25]
3    (35, 65]
4   (80, 100]
5    (25, 35]
6    (35, 65]
7    (18, 25]
8    (35, 65]
9    (18, 25]
10   (18, 25]
11   (18, 25]
12   (25, 35]
13   (18, 25]
14   (18, 25]
15   (35, 65]
16   (35, 65]
17   (35, 65]
18   (35, 65]
19   (25, 35]

In [366]:
new_age = pd.concat([newage,pd.DataFrame(pd.cut(ages,bins))],axis=1)

In [369]:
new_age.columns = ['Age','Type','Range']

In [383]:
final_age = pd.DataFrame(new_age.groupby('Type')['Range'].apply(lambda x: x.value_counts().head(1))).reset_index()

In [385]:
final_age.columns = ['Type','Range','Count of Type']

In [389]:
final_age.rename(index={0:'Level 1',1:'Level 2',2:'Level 3',3:'Level 4'})

                Type      Range  Count of Type
Level 1      Elderly  (80, 100]              1
Level 2  Middle Aged   (35, 65]              7
Level 3  Young Adult   (25, 35]              4
Level 4        Youth   (18, 25]              8

In [390]:
final_age

          Type      Range  Count of Type
0      Elderly  (80, 100]              1
1  Middle Aged   (35, 65]              7
2  Young Adult   (25, 35]              4
3        Youth   (18, 25]              8